Revit 2027 API
BuiltInFailures.RebarSystemFailures.CannotPlaceAreaReininforcement Property
 Can't find a host for Area Reinforcement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPlaceAreaReininforcement { get; }
Public Shared ReadOnly Property CannotPlaceAreaReininforcement As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPlaceAreaReininforcement {
	FailureDefinitionId^ get ();
}
static member CannotPlaceAreaReininforcement : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarSystemFailures Class
Autodesk.Revit.DB Namespace